#include <stdio.h>

int main(){
	int num = 0;
	
	for(int i1=1;i1<=13;i1++){						//i1
		for(int i2=1;i2<=13;i2++){                // i2
		//i2!=i1  i1+i2 在 1 到 13 的范围内 
			if(i2!=i1&&i1+i2>=1&&i1+i2<=13){   //i1+i2
				for(int i3=1;i3<=13;i3++){       //i3
				//i3 不等于  i1 i2, i3不等于 （i1+i2） 
					if(i3!=(i1+i2)&&i3!=i1&&i3!=i2){  
						for(int i4=1;i4<=13;i4++){  //  i4
						//i4!= i1 到 i3  及 （i1+i2） , i3-i4 要符合范围，i3-i4 不等于 i4  i1到i2, 
							if(i3-i4>=1&&i3-i4<=13&&i4!=i3&&i4!=i2&&i4!=i1&&i4!=(i1+i2)&&i3-i4!=i4&&i3-i4!=i1&&i3-i4!=i2){ //i3-i4   需要注意：i3-i4 也不能等于 i4 i2 i1 
								for(int i5 = 1;i5 <= 13;i5++){  //i5
									if(i5!=i4&&i5!=i3&&i5!=i2&&i5!=i1&&i5!=(i1+i2)&&i5!=(i3-i4)){
										for(int i6 = 1;i6 <= 13;i6++){
											if((i5*1.0/i6)==i5/i6){  //i5*1.0/i6 应该是一个整数 
											//i6 不等于 i1 到 i5 ，i6,i5/i6也不等于 （i1+i2） (i3-i4)  ,i5/i6也不等于 i1到i6 
												if(i6!=i5&&i6!=i4&&i6!=i3&&i6!=i2&&i6!=i1&&(i5/i6)!=i6&&i6!=(i1+i2)&&i6!=(i3-i4)&&(i5/i6)!=i6&&(i5/i6)!=i5&&(i5/i6)!=i4&&(i5/i6)!=i3&&(i5/i6)!=i2&&(i5/i6)!=i1&&(i5/i6)!=(i3-i4)&&(i5/i6)!=(i1+i2)){
													for(int i7=1;i7<=13;i7++){
														//i7不等于 i1 到 i6 ,i7不等于 （i1+i2） i3-i4  i5/i6 
														if(i7!=i6&&i7!=i5&&i7!=i4&&i7!=i3&&i7!=i2&&i7!=i1&&i7!=(i1+i2)&&i7!=(i3-i4)&&i7!=(i5/i6)){
															for(int i8=1;i8<=13;i8++){
																//i8不等于 i1 到 i7,i8不等于 （i1+i2） (i3-i4)  (i5/i6)
																if(i8!=i7&&i8!=i6&&i8!=i5&&i8!=i4&&i8!=i3&&i8!=i2&&i8!=i1&&i8!=(i1+i2)&&i8!=(i3-i4)&&i8!=(i5/i6)){
																	//(i7*i8) 不等于   （i1+i2） (i3-i4)  (i5/i6) ，i1 到 i8,t 在 1 到 13 
																	int t = i7*i8;
																	if(t!=i1&&t!=i2&&t!=i3&&t!=i4&&t!=i5&&t!=i6&&t!=i7&&t!=i8&&t!=(i1+i2)&&t!=(i3-i4)&&t!=(i5/i6)){
																		if(t>=1&&t<=13){
																			num++;
																		}
																	} 
																}
															}
														}
													}
												} 
											}
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}
	
	printf("%d\n",num);
	return 0;
}
